amin@zeynoth-z500:~$ sudo python3 top61.py --controller-ip 192.168.47.160
Starting Ultimate Hybrid L3 Lab with s2 redundancy path
Using controller IP from argument: 192.168.47.160
* Creating network
* Adding controller
* Adding hosts:
h1 h2 h3 h4 r1 r2 
* Adding switches:
s1 s2 s3 
* Adding links:
(h1, s1) (h2, s1) (h3, s3) (h4, s3) (200.00Mbit 3ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(200.00Mbit 3ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(r1, r2) (r1, s1) (r2, s3) (300.00Mbit 2ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(300.00Mbit 2ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(s1, s2) (100.00Mbit 10ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(100.00Mbit 10ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(s1, s3) (300.00Mbit 2ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(300.00Mbit 2ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(s2, s3) 
* Configuring hosts
h1 h2 h3 h4 r1 r2 
Starting network...
* Starting controller
c0 
* Starting 3 switches
s1 s2 s3 ...(300.00Mbit 2ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(100.00Mbit 10ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(300.00Mbit 2ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(300.00Mbit 2ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(100.00Mbit 10ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.
(300.00Mbit 2ms delay) * Error: Warning: sch_htb: quantum of class 50001 is big. Consider r2q change.

s1 fail-mode set to secure (SDN mode)
s2 fail-mode set to secure (SDN mode)
s3 fail-mode set to secure (SDN mode)
Static routing configured successfully

10.10.10.0/24 (VLAN10)                  Backbone 192.168.100.0/30                  10.20.20.0/24 (VLAN20)
┌───────────────┐                                                               ┌───────────────┐
│  h1   h2      │                                                               │  h3   h4      │
│   │   │       │                                                               │   │   │       │
└───┴───┴───────┘                                                               └───┴───┴───────┘
      │   │                                                                              │   │
   ┌──┴───┴──┐                                                                       ┌──┴───┴──┐
   │   s1     │ ────────(direct, 100Mbps/10ms)───────────────►                 │   s3     │
   │          │                                                                       │          │
   └────┬─────┘                                                                       └────┬─────┘
        │   (300Mbps/2ms)                                                                   │   (300Mbps/2ms)
        └───────────────► s2 ◄───────────────────────────────┘                           │
                        (cheaper/faster alternative path)                                │
                                │                                                         │
                         ┌──────┴──────┐                                                  │
                         │    r1        │ ────────(backbone 200Mbps/3ms)───────────►     │
                         │              │                                                  │
                         └──────┬───────┘                                                  │
                                │                                                          │
                         ┌──────┴──────┐                                                  │
                         │    r2

│ ◄───────────────────────────────────────────────┘
                         └───────────────┘

Network ready! Recommended tests:
  • Intra-LAN left  : h1 ping h2
  • Gateway test     : h1 ping 10.10.10.1
  • Inter-LAN        : h1 ping 10.20.20.11
  • Reverse inter    : h3 ping 10.10.10.11
  • Full mesh        : pingall
  • Flow table       : ovs-ofctl dump-flows s1
  • Ryu logs         : watch Ryu console for PKT/ARP lines
Running initial connectivity tests...
* Ping: testing ping reachability
h1 -> h2 h3 h4 r1 r2 
h2 -> h1 h3 h4 r1 r2 
h3 -> h1 h2 h4 r1 r2 
h4 -> h1 h2 h3 r1 r2 
r1 -> h1 h2 h3 h4 r2 
r2 -> h1 h2 h3 h4 r1 
* Results: 
 h1->h2: 1/1, rtt min/avg/max/mdev 39.897/39.897/39.897/0.000 ms
 h1->h3: 1/1, rtt min/avg/max/mdev 130.528/130.528/130.528/0.000 ms
 h1->h4: 1/1, rtt min/avg/max/mdev 83.922/83.922/83.922/0.000 ms
 h1->r1: 1/1, rtt min/avg/max/mdev 40.081/40.081/40.081/0.000 ms
 h1->r2: 1/1, rtt min/avg/max/mdev 31.517/31.517/31.517/0.000 ms
 h2->h1: 1/1, rtt min/avg/max/mdev 31.111/31.111/31.111/0.000 ms
 h2->h3: 1/1, rtt min/avg/max/mdev 129.441/129.441/129.441/0.000 ms
 h2->h4: 1/1, rtt min/avg/max/mdev 58.878/58.878/58.878/0.000 ms
 h2->r1: 1/1, rtt min/avg/max/mdev 21.015/21.015/21.015/0.000 ms
 h2->r2: 1/1, rtt min/avg/max/mdev 30.712/30.712/30.712/0.000 ms
 h3->h1: 1/1, rtt min/avg/max/mdev 61.323/61.323/61.323/0.000 ms
 h3->h2: 1/1, rtt min/avg/max/mdev 52.451/52.451/52.451/0.000 ms
 h3->h4: 1/1, rtt min/avg/max/mdev 22.519/22.519/22.519/0.000 ms
 h3->r1: 1/1, rtt min/avg/max/mdev 40.616/40.616/40.616/0.000 ms
 h3->r2: 1/1, rtt min/avg/max/mdev 25.594/25.594/25.594/0.000 ms
 h4->h1: 1/1, rtt min/avg/max/mdev 50.043/50.043/50.043/0.000 ms
 h4->h2: 1/1, rtt min/avg/max/mdev 60.036/60.036/60.036/0.000 ms
 h4->h3: 1/1, rtt min/avg/max/mdev 17.332/17.332/17.332/0.000 ms
 h4->r1: 1/1, rtt min/avg/max/mdev 26.989/26.989/26.989/0.000 ms
 h4->r2: 1/1, rtt min/avg/max/mdev 29.308/29.308/29.308/0.000 ms
 r1->h1: 1/1, rtt min/avg/max/mdev 28.959/28.959/28.959/0.000 ms
 r1->h2: 1/1, rtt min/avg/max/mdev 58.034/58.034/58.034/0.000 ms
 r1->h3: 1/1, rtt min/avg/max/mdev 29.749/29.749/29.749/0.000 ms
 r1->h4: 1/1, rtt min/avg/max/mdev 24.193/24.193/24.193/0.000 ms
 r1->r2: 1/1, rtt min/avg/max/mdev 6.392/6.392/6.392/0.000 ms
 r2->h1: 1/1, rtt min/avg/max/mdev 27.413/27.413/27.413/0.000 ms
 r2->h2: 1/1, rtt min/avg/max/mdev 36.418/36.418/36.418/0.000 ms
 r2->h3: 1/1, rtt min/avg/max/mdev 20.576/20.576/20.576/0.000 ms
 r2->h4: 1/1, rtt min/avg/max/mdev 21.315/21.315/21.315/0.000 ms
 r2->r1: 1/1, rtt min/avg/max/mdev 6.367/6.367/6.367/0.000 ms
* Starting CLI:
mininet> h1 ping h4
PING 10.20.20.12 (10.20.20.12) 56(84) bytes of data.
64 bytes from 10.20.20.12: icmp_seq=1 ttl=62 time=30.9 ms
64 bytes from 10.20.20.12: icmp_seq=2 ttl=62 time=22.7 ms
64 bytes from 10.20.20.12: icmp_seq=3 ttl=62 time=22.6 ms
^C
--- 10.20.20.12 ping statistics ---
3 packets transmitted, 3 received, 0% packet loss, time 1998ms
rtt min/avg/max/mdev = 22.600/25.403/30.916/3.898 ms
mininet> h2 ping h3
PING 10.20.20.11 (10.20.20.11) 56(84) bytes of data.
64 bytes from 10.20.20.11: icmp_seq=1 ttl=62 time=26.7 ms
64 bytes from 10.20.20.11: icmp_seq=2 ttl=62 time=29.6 ms
64 bytes from 10.20.20.11: icmp_seq=3 ttl=62 time=24.6 ms
64 bytes from 10.20.20.11: icmp_seq=4 ttl=62 time=31.0 ms
^C
--- 10.20.20.11 ping statistics ---
4 packets transmitted, 4 received, 0% packet loss, time 2997ms
rtt min/avg/max/mdev = 24.645/27.983/31.049/2.484 ms
mininet> pingall
* Ping: testing ping reachability
h1 -> h2 h3 h4 r1 r2 
h2 -> h1 h3 h4 r1 r2 
h3 -> h1 h2 h4 r1 r2 
h4 -> h1 h2 h3 r1 r2 
r1 -> h1 h2 h3 h4 r2 
r2 -> h1 h2 h3 h4 r1 
* Results: 0% dropped (30/30 received)
mininet> pingall
* Ping: testing ping reachability
h1 -> h2 h3 h4 r1 r2 
h2 -> h1 h3 h4 r1 r2 
h3 -> h1 h2 h4 r1 r2 
h4 -> h1 h2 h3 r1 r2 
r1 -> h1 h2 h3 h4 r2 
r2 -> h1 h2 h3 h4 r1 
* Results: 0% dropped (30/30 received)
mininet> h2 ping h3
PING 10.20.20.11 (10.20.20.11) 56(84) bytes of data.
64 bytes from 10.20.20.11: icmp_seq=1 ttl=62 time=27.3 ms
64 bytes from 10.20.20.11: icmp_se

q=2 ttl=62 time=25.0 ms
64 bytes from 10.20.20.11: icmp_seq=3 ttl=62 time=24.5 ms
64 bytes from 10.20.20.11: icmp_seq=4 ttl=62 time=24.4 ms
64 bytes from 10.20.20.11: icmp_seq=5 ttl=62 time=77.2 ms
64 bytes from 10.20.20.11: icmp_seq=6 ttl=62 time=25.6 ms
64 bytes from 10.20.20.11: icmp_seq=7 ttl=62 time=33.4 ms
64 bytes from 10.20.20.11: icmp_seq=8 ttl=62 time=27.7 ms
64 bytes from 10.20.20.11: icmp_seq=9 ttl=62 time=26.0 ms
64 bytes from 10.20.20.11: icmp_seq=10 ttl=62 time=25.3 ms
64 bytes from 10.20.20.11: icmp_seq=11 ttl=62 time=36.1 ms
64 bytes from 10.20.20.11: icmp_seq=12 ttl=62 time=27.2 ms
64 bytes from 10.20.20.11: icmp_seq=13 ttl=62 time=23.1 ms
64 bytes from 10.20.20.11: icmp_seq=14 ttl=62 time=26.2 ms
64 bytes from 10.20.20.11: icmp_seq=15 ttl=62 time=24.5 ms
64 bytes from 10.20.20.11: icmp_seq=16 ttl=62 time=28.1 ms
64 bytes from 10.20.20.11: icmp_seq=17 ttl=62 time=28.9 ms
64 bytes from 10.20.20.11: icmp_seq=18 ttl=62 time=23.3 ms
64 bytes from 10.20.20.11: icmp_seq=19 ttl=62 time=24.4 ms
64 bytes from 10.20.20.11: icmp_seq=20 ttl=62 time=27.9 ms
64 bytes from 10.20.20.11: icmp_seq=21 ttl=62 time=26.0 ms
64 bytes from 10.20.20.11: icmp_seq=22 ttl=62 time=23.1 ms
64 bytes from 10.20.20.11: icmp_seq=23 ttl=62 time=33.8 ms
64 bytes from 10.20.20.11: icmp_seq=24 ttl=62 time=24.2 ms
64 bytes from 10.20.20.11: icmp_seq=25 ttl=62 time=29.0 ms
64 bytes from 10.20.20.11: icmp_seq=26 ttl=62 time=25.7 ms

--- 10.20.20.11 ping statistics ---
26 packets transmitted, 26 received, 0% packet loss, time 24980ms
rtt min/avg/max/mdev = 23.060/28.762/77.238/10.217 ms
mininet> show ip route
* Unknown command: show ip route
mininet> h1 show ip route
bash: show: command not found
mininet> pingall
* Ping: testing ping reachability
h1 -> h2 h3 h4 r1 r2 
h2 -> h1 h3 h4 r1 r2 
h3 -> h1 h2 h4 r1 r2 
h4 -> h1 h2 h3 r1 r2 
r1 -> h1 h2 h3 h4 r2 
r2 -> h1 h2 h3 h4 r1 
* Results: 0% dropped (30/30 received)
mininet> h1 arp -n
Address                  HWtype  HWaddress           Flags Mask            Iface
10.10.10.1               ether   00:00:00:00:00:05   C                     h1-eth0
10.10.10.12              ether   00:00:00:00:00:02   CM                    h1-eth0
mininet> h2 arp -n
Address                  HWtype  HWaddress           Flags Mask            Iface
10.10.10.11              ether   00:00:00:00:00:01   CM                    h2-eth0
10.10.10.1               ether   00:00:00:00:00:05   C                     h2-eth0
mininet> h3 arp -n
Address                  HWtype  HWaddress           Flags Mask            Iface
10.20.20.12              ether   00:00:00:00:00:04   CM                    h3-eth0
10.20.20.1               ether   00:00:00:00:00:06   C                     h3-eth0
mininet> h4 arp -n
Address                  HWtype  HWaddress           Flags Mask            Iface
10.20.20.11              ether   00:00:00:00:00:03   CM                    h4-eth0
10.20.20.1               ether   00:00:00:00:00:06   C                     h4-eth0
mininet> pingall
* Ping: testing ping reachability
h1 -> h2 h3 h4 r1 r2 
h2 -> h1 h3 h4 r1 r2 
h3 -> h1 h2 h4 r1 r2 
h4 -> h1 h2 h3 r1 r2 
r1 -> h1 h2 h3 h4 r2 
r2 -> h1 h2 h3 h4 r1 
* Results: 0% dropped (30/30 received)
mininet> exit
* Stopping 1 controllers
c0 
* Stopping 10 links
..........
* Stopping 3 switches
s1 s2 s3 
* Stopping 6 hosts
h1 h2 h3 h4 r1 r2 
* Done
